; domain
(define (domain joust-circuit)
(:requirements :strips :typing)
(:types arena competitor rank - object
  keep pavilion - arena
  knight trophy - competitor)

(:predicates (carried ?g - trophy ?t - knight ?l - rank)
       (for-claim ?g - trophy ?m - pavilion ?l - rank)
       (kept ?g - trophy ?l - rank)
       (offered ?g - trophy ?m -  pavilion ?l - rank)
       (succeeds ?l1 ?l2 - rank)
       (posted-at ?t - knight ?p - arena)
       (linked-to ?p1 ?p2 - arena))

(:action ride
 :parameters (?t - knight ?from ?to - arena)
 :precondition (and (posted-at ?t ?from) (linked-to ?from ?to))
 :effect (and (not (posted-at ?t ?from)) (posted-at ?t ?to)))

; ### LOAD ###
; ?l1 is the level of ?g ready to be loaded at ?m before loading
; ?l2 is the level of ?g ready to be loaded at ?m after loading
; ?l3 is the level of ?g in ?t before loading
; ?l4 is the level of ?g in ?t after loading

(:action claim
 :parameters (?g - trophy ?t - knight ?m - pavilion ?l1 ?l2 ?l3 ?l4 - rank)
 :precondition (and (posted-at ?t ?m) (carried ?g ?t ?l3)
        (for-claim ?g ?m ?l2) (succeeds ?l2 ?l1) (succeeds ?l4 ?l3))
 :effect (and (carried ?g ?t ?l4) (not (carried ?g ?t ?l3))
        (for-claim ?g ?m ?l1) (not (for-claim ?g ?m ?l2))))


; ### UNLOAD ###
; ?l1 is the level of ?g in ?t before unloading
; ?l2 is the level of ?g in ?t after unloading
; ?l3 is the level of ?g in ?d before unloading
; ?l4 is the level of ?g in ?d after unloading

(:action stash
 :parameters (?g - trophy ?t - knight ?d - keep ?l1 ?l2 ?l3 ?l4 - rank)
 :precondition (and (posted-at ?t ?d) (carried ?g ?t ?l2)
        (kept ?g ?l3) (succeeds ?l2 ?l1) (succeeds ?l4 ?l3))
 :effect (and (carried ?g ?t ?l1) (not (carried ?g ?t ?l2))
        (kept ?g ?l4) (not (kept ?g ?l3))))


; ### BUY ###
; ?l1 is the level of ?g on sale at ?m before buying
; ?l2 is the level of ?g on sale at ?m after buying
; ?l3 is the level of ?g ready to be loaded at ?m before buying
; ?l4 is the level of ?g ready to be loaded at ?m after buying

(:action seize
 :parameters (?t - knight ?g - trophy ?m - pavilion ?l1 ?l2 ?l3 ?l4 - rank)
 :precondition (and (posted-at ?t ?m) (offered ?g ?m ?l2) (for-claim ?g ?m ?l3)
        (succeeds ?l2 ?l1) (succeeds ?l4 ?l3))
 :effect (and (offered ?g ?m ?l1) (not (offered ?g ?m ?l2))
        (for-claim ?g ?m ?l4) (not (for-claim ?g ?m ?l3))))
)

; problem
; Domain designed by Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem TPP)
(:domain joust-circuit)
(:objects
  trophy1 trophy2 trophy3 - trophy
  knight1 - knight
  pavilion1 - pavilion
  keep1 - keep
  rank0 rank1 - rank)

(:init
  (succeeds rank1 rank0)
  (for-claim trophy1 pavilion1 rank0)
  (for-claim trophy2 pavilion1 rank0)
  (for-claim trophy3 pavilion1 rank0)
  (kept trophy1 rank0)
  (kept trophy2 rank0)
  (kept trophy3 rank0)
  (carried trophy1 knight1 rank0)
  (carried trophy2 knight1 rank0)
  (carried trophy3 knight1 rank0)
  (linked-to keep1 pavilion1)
  (linked-to pavilion1 keep1)
  (offered trophy1 pavilion1 rank1)
  (offered trophy2 pavilion1 rank1)
  (offered trophy3 pavilion1 rank1)
  (posted-at knight1 keep1))

(:goal (and
  (kept trophy1 rank1)
  (kept trophy2 rank1)
  (kept trophy3 rank1)))

)

; plan
1. (ride knight1 keep1 pavilion1)
   deleted: (posted-at knight1 keep1)
   added: (posted-at knight1 pavilion1)
   goals met: 0 of 3
2. (seize knight1 trophy3 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (offered trophy3 pavilion1 rank1) (for-claim trophy3 pavilion1 rank0)
   added: (offered trophy3 pavilion1 rank0) (for-claim trophy3 pavilion1 rank1)
   goals met: 0 of 3
3. (claim trophy3 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy3 knight1 rank0) (for-claim trophy3 pavilion1 rank1)
   added: (carried trophy3 knight1 rank1) (for-claim trophy3 pavilion1 rank0)
   goals met: 0 of 3
4. (seize knight1 trophy2 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (offered trophy2 pavilion1 rank1) (for-claim trophy2 pavilion1 rank0)
   added: (offered trophy2 pavilion1 rank0) (for-claim trophy2 pavilion1 rank1)
   goals met: 0 of 3
5. (claim trophy2 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy2 knight1 rank0) (for-claim trophy2 pavilion1 rank1)
   added: (carried trophy2 knight1 rank1) (for-claim trophy2 pavilion1 rank0)
   goals met: 0 of 3
6. (ride knight1 pavilion1 keep1)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep1)
   goals met: 0 of 3
7. (stash trophy3 knight1 keep1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy3 knight1 rank1) (kept trophy3 rank0)
   added: (carried trophy3 knight1 rank0) (kept trophy3 rank1)
   goals met: 1 of 3
8. (stash trophy2 knight1 keep1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy2 knight1 rank1) (kept trophy2 rank0)
   added: (carried trophy2 knight1 rank0) (kept trophy2 rank1)
   goals met: 2 of 3
9. (ride knight1 keep1 pavilion1)
   deleted: (posted-at knight1 keep1)
   added: (posted-at knight1 pavilion1)
   goals met: 2 of 3
10. (seize knight1 trophy1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (offered trophy1 pavilion1 rank1) (for-claim trophy1 pavilion1 rank0)
   added: (offered trophy1 pavilion1 rank0) (for-claim trophy1 pavilion1 rank1)
   goals met: 2 of 3
11. (claim trophy1 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy1 knight1 rank0) (for-claim trophy1 pavilion1 rank1)
   added: (carried trophy1 knight1 rank1) (for-claim trophy1 pavilion1 rank0)
   goals met: 2 of 3
12. (ride knight1 pavilion1 keep1)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep1)
   goals met: 2 of 3
13. (stash trophy1 knight1 keep1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy1 knight1 rank1) (kept trophy1 rank0)
   added: (carried trophy1 knight1 rank0) (kept trophy1 rank1)
   goals met: 3 of 3
